FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sc_reg.h
     * |        |          |Sets this bit to enable UART mode function.
     * |        |          |0 = Smart Card mode.
     * |        |          |1 = UART mode.
     * |        |          |Note1: When operating in UART mode, user must set CONSEL (SCn_CTL[5:4]) = 00 and AUTOCEN (SCn_CTL[3]) = 0.
     * |        |          |Note2: When operating in Smart Card mode, user must set UARTEN (SCn_UARTCTL[0]) = 0.
     * |        |          |Note3: When UART mode is enabled, hardware will generate a reset to reset FIFO and internal state machine.
     * |[5:4]   |WLS       |Word Length Selection
     * |        |          |This field is used for select UART data length.
     * |        |          |00 = Word length is 8 bits.
     * |        |          |01 = Word length is 7 bits.
     * |        |          |10 = Word length is 6 bits.
     * |        |          |11 = Word length is 5 bits.
     * |        |          |Note: In smart card mode, this WLS must be u201800'.
     * |[6]     |PBOFF     |Parity Bit Disable Control
     * |        |          |Sets this bit is used for disable parity check function.
     * |        |          |0 = Parity bit is generated or checked between the last data word bit and stop bit of the serial data.
     * |        |          |1 = Parity bit is not generated (transmitting data) or checked (receiving data) during transfer.
     * |        |          |Note: In smart card mode, this field must be u20180' (default setting is with parity bit).
     * |[7]     |OPE       |Odd Parity Enable Bit
     * |        |          |This is used for odd/even parity selection.
     * |        |          |0 = Even number of logic 1's are transmitted or check the data word and parity bits in receiving mode.
     * |        |          |1 = Odd number of logic 1's are transmitted or check the data word and parity bits in receiving mode.
     * |        |          |Note: This bit has effect only when PBOFF bit is u20180'.
     * @var SC_T::ACTCTL
     * Offset: 0x4C  SC Activation Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:0]   |T1EXT     |T1 Extend Time of Hardware Activation
     * |        |          |This field provide the configurable cycles to extend the activation time T1 period.
     * |        |          |The cycle scaling factor is 2048.
     * |        |          |Extend cycles = (filled value * 2048) cycles.
     * |        |          |Refer to SC activation sequence in Figure 6.17-4 SC Activation Sequence.
     * |        |          |For example,
     * |        |          |SCLK = 4MHz, each cycle = 0.25us,.
     * |        |          |Filled 20 to this field
     * |        |          |Extend time = 20 * 2048 * 0.25us = 10.24 ms.
     * |        |          |Note: Setting 0 to this field conforms to the protocol ISO/IEC 7816-3
     */
    __IO uint32_t DAT;     /*!< [0x0000] SC Receive/Transmit Holding Buffer Register                      */
    __IO uint32_t CTL;     /*!< [0x0004] SC Control Register                                              */
    __IO uint32_t ALTCTL;  /*!< [0x0008] SC Alternate Control Register                                    */
    __IO uint32_t EGT;     /*!< [0x000c] SC Extra Guard Time Register                                     */
    __IO uint32_t RXTOUT;  /*!< [0x0010] SC Receive Buffer Time-out Counter Register                      */
    __IO uint32_t ETUCTL;  /*!< [0x0014] SC Element Time Unit Control Register                            */
    __IO uint32_t INTEN;   /*!< [0x0018] SC Interrupt Enable Control Register                             */
    __IO uint32_t INTSTS;  /*!< [0x001c] SC Interrupt Status Register                                     */
    __IO uint32_t STATUS;  /*!< [0x0020] SC Transfer Status Register                                      */
    __IO uint32_t PINCTL;  /*!< [0x0024] SC Pin Control State Register                                    */
    __IO uint32_t TMRCTL0; /*!< [0x0028] SC Internal Timer0 Control Register                              */
    __IO uint32_t TMRCTL1; /*!< [0x002c] SC Internal Timer1 Control Register                              */
    __IO uint32_t TMRCTL2; /*!< [0x0030] SC Internal Timer2 Control Register                              */
    __IO uint32_t UARTCTL; /*!< [0x0034] SC UART Mode Control Register                                    */
    __I uint32_t RESERVE0[ 5 ];
    __IO uint32_t ACTCTL;  /*!< [0x004c] SC Activation Control Register                                   */
} SC_T;

/**
 *  @addtogroup SC_CONST SC Bit Field Definition
 *  Constant Definitions for SC Controller
 * @{ */

#define SC_DAT_DAT_Pos            ( 0 )                                                    /*!< SC_T::DAT: DAT Position                */
#define SC_DAT_DAT_Msk            ( 0xfful << SC_DAT_DAT_Pos )                             /*!< SC_T::DAT: DAT Mask                    */

#define SC_CTL_SCEN_Pos           ( 0 )                                                    /*!< SC_T::CTL: SCEN Position               */
#define SC_CTL_SCEN_Msk           ( 0x1ul << SC_CTL_SCEN_Pos )                             /*!< SC_T::CTL: SCEN Mask                   */

#define SC_CTL_RXOFF_Pos          ( 1 )                                                    /*!< SC_T::CTL: RXOFF Position              */
#define SC_CTL_RXOFF_Msk          ( 0x1ul << SC_CTL_RXOFF_Pos )                            /*!< SC_T::CTL: RXOFF Mask                  */

#define SC_CTL_TXOFF_Pos          ( 2 )                                                    /*!< SC_T::CTL: TXOFF Position              */
#define SC_CTL_TXOFF_Msk          ( 0x1ul << SC_CTL_TXOFF_Pos )                            /*!< SC_T::CTL: TXOFF Mask                  */

#define SC_CTL_AUTOCEN_Pos        ( 3 )                                                    /*!< SC_T::CTL: AUTOCEN Position            */
#define SC_CTL_AUTOCEN_Msk        ( 0x1ul << SC_CTL_AUTOCEN_Pos )                          /*!< SC_T::CTL: AUTOCEN Mask                */

#define SC_CTL_CONSEL_Pos         ( 4 )                                                    /*!< SC_T::CTL: CONSEL Position             */
#define SC_CTL_CONSEL_Msk         ( 0x3ul << SC_CTL_CONSEL_Pos )                           /*!< SC_T::CTL: CONSEL Mask                 */

#define SC_CTL_RXTRGLV_Pos        ( 6 )                                                    /*!< SC_T::CTL: RXTRGLV Position            */
#define SC_CTL_RXTRGLV_Msk        ( 0x3ul << SC_CTL_RXTRGLV_Pos )                          /*!< SC_T::CTL: RXTRGLV Mask                */

#define SC_CTL_BGT_Pos            ( 8 )                                                    /*!< SC_T::CTL: BGT Position                */
#define SC_CTL_BGT_Msk            ( 0x1ful << SC_CTL_BGT_Pos )                             /*!< SC_T::CTL: BGT Mask                    */

#define SC_CTL_TMRSEL_Pos         ( 13 )                                                   /*!< SC_T::CTL: TMRSEL Position             */
#define SC_CTL_TMRSEL_Msk         ( 0x3ul << SC_CTL_TMRSEL_Pos )                           /*!< SC_T::CTL: TMRSEL Mask                 */

#define SC_CTL_NSB_Pos            ( 15 )                                                   /*!< SC_T::CTL: NSB Position                */
#define SC_CTL_NSB_Msk            ( 0x1ul << SC_CTL_NSB_Pos )                              /*!< SC_T::CTL: NSB Mask                    */

