FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sc_reg.h
#define SC_CTL_RXRTY_Pos          ( 16 )                                                   /*!< SC_T::CTL: RXRTY Position              */
#define SC_CTL_RXRTY_Msk          ( 0x7ul << SC_CTL_RXRTY_Pos )                            /*!< SC_T::CTL: RXRTY Mask                  */

#define SC_CTL_RXRTYEN_Pos        ( 19 )                                                   /*!< SC_T::CTL: RXRTYEN Position            */
#define SC_CTL_RXRTYEN_Msk        ( 0x1ul << SC_CTL_RXRTYEN_Pos )                          /*!< SC_T::CTL: RXRTYEN Mask                */

#define SC_CTL_TXRTY_Pos          ( 20 )                                                   /*!< SC_T::CTL: TXRTY Position              */
#define SC_CTL_TXRTY_Msk          ( 0x7ul << SC_CTL_TXRTY_Pos )                            /*!< SC_T::CTL: TXRTY Mask                  */

#define SC_CTL_TXRTYEN_Pos        ( 23 )                                                   /*!< SC_T::CTL: TXRTYEN Position            */
#define SC_CTL_TXRTYEN_Msk        ( 0x1ul << SC_CTL_TXRTYEN_Pos )                          /*!< SC_T::CTL: TXRTYEN Mask                */

#define SC_CTL_CDDBSEL_Pos        ( 24 )                                                   /*!< SC_T::CTL: CDDBSEL Position            */
#define SC_CTL_CDDBSEL_Msk        ( 0x3ul << SC_CTL_CDDBSEL_Pos )                          /*!< SC_T::CTL: CDDBSEL Mask                */

#define SC_CTL_CDLV_Pos           ( 26 )                                                   /*!< SC_T::CTL: CDLV Position               */
#define SC_CTL_CDLV_Msk           ( 0x1ul << SC_CTL_CDLV_Pos )                             /*!< SC_T::CTL: CDLV Mask                   */

#define SC_CTL_SYNC_Pos           ( 30 )                                                   /*!< SC_T::CTL: SYNC Position               */
#define SC_CTL_SYNC_Msk           ( 0x1ul << SC_CTL_SYNC_Pos )                             /*!< SC_T::CTL: SYNC Mask                   */

#define SC_ALTCTL_TXRST_Pos       ( 0 )                                                    /*!< SC_T::ALTCTL: TXRST Position           */
#define SC_ALTCTL_TXRST_Msk       ( 0x1ul << SC_ALTCTL_TXRST_Pos )                         /*!< SC_T::ALTCTL: TXRST Mask               */

#define SC_ALTCTL_RXRST_Pos       ( 1 )                                                    /*!< SC_T::ALTCTL: RXRST Position           */
#define SC_ALTCTL_RXRST_Msk       ( 0x1ul << SC_ALTCTL_RXRST_Pos )                         /*!< SC_T::ALTCTL: RXRST Mask               */

#define SC_ALTCTL_DACTEN_Pos      ( 2 )                                                    /*!< SC_T::ALTCTL: DACTEN Position          */
#define SC_ALTCTL_DACTEN_Msk      ( 0x1ul << SC_ALTCTL_DACTEN_Pos )                        /*!< SC_T::ALTCTL: DACTEN Mask              */

#define SC_ALTCTL_ACTEN_Pos       ( 3 )                                                    /*!< SC_T::ALTCTL: ACTEN Position           */
#define SC_ALTCTL_ACTEN_Msk       ( 0x1ul << SC_ALTCTL_ACTEN_Pos )                         /*!< SC_T::ALTCTL: ACTEN Mask               */

#define SC_ALTCTL_WARSTEN_Pos     ( 4 )                                                    /*!< SC_T::ALTCTL: WARSTEN Position         */
#define SC_ALTCTL_WARSTEN_Msk     ( 0x1ul << SC_ALTCTL_WARSTEN_Pos )                       /*!< SC_T::ALTCTL: WARSTEN Mask             */

#define SC_ALTCTL_CNTEN0_Pos      ( 5 )                                                    /*!< SC_T::ALTCTL: CNTEN0 Position          */
#define SC_ALTCTL_CNTEN0_Msk      ( 0x1ul << SC_ALTCTL_CNTEN0_Pos )                        /*!< SC_T::ALTCTL: CNTEN0 Mask              */

#define SC_ALTCTL_CNTEN1_Pos      ( 6 )                                                    /*!< SC_T::ALTCTL: CNTEN1 Position          */
#define SC_ALTCTL_CNTEN1_Msk      ( 0x1ul << SC_ALTCTL_CNTEN1_Pos )                        /*!< SC_T::ALTCTL: CNTEN1 Mask              */

#define SC_ALTCTL_CNTEN2_Pos      ( 7 )                                                    /*!< SC_T::ALTCTL: CNTEN2 Position          */
#define SC_ALTCTL_CNTEN2_Msk      ( 0x1ul << SC_ALTCTL_CNTEN2_Pos )                        /*!< SC_T::ALTCTL: CNTEN2 Mask              */

#define SC_ALTCTL_INITSEL_Pos     ( 8 )                                                    /*!< SC_T::ALTCTL: INITSEL Position         */
#define SC_ALTCTL_INITSEL_Msk     ( 0x3ul << SC_ALTCTL_INITSEL_Pos )                       /*!< SC_T::ALTCTL: INITSEL Mask             */

#define SC_ALTCTL_ADACEN_Pos      ( 11 )                                                   /*!< SC_T::ALTCTL: ADACEN Position          */
#define SC_ALTCTL_ADACEN_Msk      ( 0x1ul << SC_ALTCTL_ADACEN_Pos )                        /*!< SC_T::ALTCTL: ADACEN Mask              */

#define SC_ALTCTL_RXBGTEN_Pos     ( 12 )                                                   /*!< SC_T::ALTCTL: RXBGTEN Position         */
#define SC_ALTCTL_RXBGTEN_Msk     ( 0x1ul << SC_ALTCTL_RXBGTEN_Pos )                       /*!< SC_T::ALTCTL: RXBGTEN Mask             */

#define SC_ALTCTL_ACTSTS0_Pos     ( 13 )                                                   /*!< SC_T::ALTCTL: ACTSTS0 Position         */
#define SC_ALTCTL_ACTSTS0_Msk     ( 0x1ul << SC_ALTCTL_ACTSTS0_Pos )                       /*!< SC_T::ALTCTL: ACTSTS0 Mask             */

#define SC_ALTCTL_ACTSTS1_Pos     ( 14 )                                                   /*!< SC_T::ALTCTL: ACTSTS1 Position         */
#define SC_ALTCTL_ACTSTS1_Msk     ( 0x1ul << SC_ALTCTL_ACTSTS1_Pos )                       /*!< SC_T::ALTCTL: ACTSTS1 Mask             */

#define SC_ALTCTL_ACTSTS2_Pos     ( 15 )                                                   /*!< SC_T::ALTCTL: ACTSTS2 Position         */
#define SC_ALTCTL_ACTSTS2_Msk     ( 0x1ul << SC_ALTCTL_ACTSTS2_Pos )                       /*!< SC_T::ALTCTL: ACTSTS2 Mask             */

#define SC_ALTCTL_SYNC_Pos        ( 31 )                                                   /*!< SC_T::ALTCTL: SYNC Position            */
#define SC_ALTCTL_SYNC_Msk        ( 0x1ul << SC_ALTCTL_SYNC_Pos )                          /*!< SC_T::ALTCTL: SYNC Mask                */

