FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sc_reg.h
#define SC_EGT_EGT_Pos            ( 0 )                                                    /*!< SC_T::EGT: EGT Position                */
#define SC_EGT_EGT_Msk            ( 0xfful << SC_EGT_EGT_Pos )                             /*!< SC_T::EGT: EGT Mask                    */

#define SC_RXTOUT_RFTM_Pos        ( 0 )                                                    /*!< SC_T::RXTOUT: RFTM Position            */
#define SC_RXTOUT_RFTM_Msk        ( 0x1fful << SC_RXTOUT_RFTM_Pos )                        /*!< SC_T::RXTOUT: RFTM Mask                */

#define SC_ETUCTL_ETURDIV_Pos     ( 0 )                                                    /*!< SC_T::ETUCTL: ETURDIV Position         */
#define SC_ETUCTL_ETURDIV_Msk     ( 0xffful << SC_ETUCTL_ETURDIV_Pos )                     /*!< SC_T::ETUCTL: ETURDIV Mask             */

#define SC_INTEN_RDAIEN_Pos       ( 0 )                                                    /*!< SC_T::INTEN: RDAIEN Position           */
#define SC_INTEN_RDAIEN_Msk       ( 0x1ul << SC_INTEN_RDAIEN_Pos )                         /*!< SC_T::INTEN: RDAIEN Mask               */

#define SC_INTEN_TBEIEN_Pos       ( 1 )                                                    /*!< SC_T::INTEN: TBEIEN Position           */
#define SC_INTEN_TBEIEN_Msk       ( 0x1ul << SC_INTEN_TBEIEN_Pos )                         /*!< SC_T::INTEN: TBEIEN Mask               */

#define SC_INTEN_TERRIEN_Pos      ( 2 )                                                    /*!< SC_T::INTEN: TERRIEN Position          */
#define SC_INTEN_TERRIEN_Msk      ( 0x1ul << SC_INTEN_TERRIEN_Pos )                        /*!< SC_T::INTEN: TERRIEN Mask              */

#define SC_INTEN_TMR0IEN_Pos      ( 3 )                                                    /*!< SC_T::INTEN: TMR0IEN Position          */
#define SC_INTEN_TMR0IEN_Msk      ( 0x1ul << SC_INTEN_TMR0IEN_Pos )                        /*!< SC_T::INTEN: TMR0IEN Mask              */

#define SC_INTEN_TMR1IEN_Pos      ( 4 )                                                    /*!< SC_T::INTEN: TMR1IEN Position          */
#define SC_INTEN_TMR1IEN_Msk      ( 0x1ul << SC_INTEN_TMR1IEN_Pos )                        /*!< SC_T::INTEN: TMR1IEN Mask              */

#define SC_INTEN_TMR2IEN_Pos      ( 5 )                                                    /*!< SC_T::INTEN: TMR2IEN Position          */
#define SC_INTEN_TMR2IEN_Msk      ( 0x1ul << SC_INTEN_TMR2IEN_Pos )                        /*!< SC_T::INTEN: TMR2IEN Mask              */

#define SC_INTEN_BGTIEN_Pos       ( 6 )                                                    /*!< SC_T::INTEN: BGTIEN Position           */
#define SC_INTEN_BGTIEN_Msk       ( 0x1ul << SC_INTEN_BGTIEN_Pos )                         /*!< SC_T::INTEN: BGTIEN Mask               */

#define SC_INTEN_CDIEN_Pos        ( 7 )                                                    /*!< SC_T::INTEN: CDIEN Position            */
#define SC_INTEN_CDIEN_Msk        ( 0x1ul << SC_INTEN_CDIEN_Pos )                          /*!< SC_T::INTEN: CDIEN Mask                */

#define SC_INTEN_INITIEN_Pos      ( 8 )                                                    /*!< SC_T::INTEN: INITIEN Position          */
#define SC_INTEN_INITIEN_Msk      ( 0x1ul << SC_INTEN_INITIEN_Pos )                        /*!< SC_T::INTEN: INITIEN Mask              */

#define SC_INTEN_RXTOIEN_Pos      ( 9 )                                                    /*!< SC_T::INTEN: RXTOIEN Position          */
#define SC_INTEN_RXTOIEN_Msk      ( 0x1ul << SC_INTEN_RXTOIEN_Pos )                        /*!< SC_T::INTEN: RXTOIEN Mask              */

#define SC_INTEN_ACERRIEN_Pos     ( 10 )                                                   /*!< SC_T::INTEN: ACERRIEN Position         */
#define SC_INTEN_ACERRIEN_Msk     ( 0x1ul << SC_INTEN_ACERRIEN_Pos )                       /*!< SC_T::INTEN: ACERRIEN Mask             */

#define SC_INTSTS_RDAIF_Pos       ( 0 )                                                    /*!< SC_T::INTSTS: RDAIF Position           */
#define SC_INTSTS_RDAIF_Msk       ( 0x1ul << SC_INTSTS_RDAIF_Pos )                         /*!< SC_T::INTSTS: RDAIF Mask               */

#define SC_INTSTS_TBEIF_Pos       ( 1 )                                                    /*!< SC_T::INTSTS: TBEIF Position           */
#define SC_INTSTS_TBEIF_Msk       ( 0x1ul << SC_INTSTS_TBEIF_Pos )                         /*!< SC_T::INTSTS: TBEIF Mask               */

#define SC_INTSTS_TERRIF_Pos      ( 2 )                                                    /*!< SC_T::INTSTS: TERRIF Position          */
#define SC_INTSTS_TERRIF_Msk      ( 0x1ul << SC_INTSTS_TERRIF_Pos )                        /*!< SC_T::INTSTS: TERRIF Mask              */

#define SC_INTSTS_TMR0IF_Pos      ( 3 )                                                    /*!< SC_T::INTSTS: TMR0IF Position          */
#define SC_INTSTS_TMR0IF_Msk      ( 0x1ul << SC_INTSTS_TMR0IF_Pos )                        /*!< SC_T::INTSTS: TMR0IF Mask              */

#define SC_INTSTS_TMR1IF_Pos      ( 4 )                                                    /*!< SC_T::INTSTS: TMR1IF Position          */
#define SC_INTSTS_TMR1IF_Msk      ( 0x1ul << SC_INTSTS_TMR1IF_Pos )                        /*!< SC_T::INTSTS: TMR1IF Mask              */

#define SC_INTSTS_TMR2IF_Pos      ( 5 )                                                    /*!< SC_T::INTSTS: TMR2IF Position          */
#define SC_INTSTS_TMR2IF_Msk      ( 0x1ul << SC_INTSTS_TMR2IF_Pos )                        /*!< SC_T::INTSTS: TMR2IF Mask              */

#define SC_INTSTS_BGTIF_Pos       ( 6 )                                                    /*!< SC_T::INTSTS: BGTIF Position           */
#define SC_INTSTS_BGTIF_Msk       ( 0x1ul << SC_INTSTS_BGTIF_Pos )                         /*!< SC_T::INTSTS: BGTIF Mask               */

#define SC_INTSTS_CDIF_Pos        ( 7 )                                                    /*!< SC_T::INTSTS: CDIF Position            */
#define SC_INTSTS_CDIF_Msk        ( 0x1ul << SC_INTSTS_CDIF_Pos )                          /*!< SC_T::INTSTS: CDIF Mask                */

#define SC_INTSTS_INITIF_Pos      ( 8 )                                                    /*!< SC_T::INTSTS: INITIF Position          */
#define SC_INTSTS_INITIF_Msk      ( 0x1ul << SC_INTSTS_INITIF_Pos )                        /*!< SC_T::INTSTS: INITIF Mask              */

