FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sc_reg.h
#define SC_INTSTS_RXTOIF_Pos      ( 9 )                                                    /*!< SC_T::INTSTS: RXTOIF Position          */
#define SC_INTSTS_RXTOIF_Msk      ( 0x1ul << SC_INTSTS_RXTOIF_Pos )                        /*!< SC_T::INTSTS: RXTOIF Mask              */

#define SC_INTSTS_ACERRIF_Pos     ( 10 )                                                   /*!< SC_T::INTSTS: ACERRIF Position         */
#define SC_INTSTS_ACERRIF_Msk     ( 0x1ul << SC_INTSTS_ACERRIF_Pos )                       /*!< SC_T::INTSTS: ACERRIF Mask             */

#define SC_STATUS_RXOV_Pos        ( 0 )                                                    /*!< SC_T::STATUS: RXOV Position            */
#define SC_STATUS_RXOV_Msk        ( 0x1ul << SC_STATUS_RXOV_Pos )                          /*!< SC_T::STATUS: RXOV Mask                */

#define SC_STATUS_RXEMPTY_Pos     ( 1 )                                                    /*!< SC_T::STATUS: RXEMPTY Position         */
#define SC_STATUS_RXEMPTY_Msk     ( 0x1ul << SC_STATUS_RXEMPTY_Pos )                       /*!< SC_T::STATUS: RXEMPTY Mask             */

#define SC_STATUS_RXFULL_Pos      ( 2 )                                                    /*!< SC_T::STATUS: RXFULL Position          */
#define SC_STATUS_RXFULL_Msk      ( 0x1ul << SC_STATUS_RXFULL_Pos )                        /*!< SC_T::STATUS: RXFULL Mask              */

#define SC_STATUS_PEF_Pos         ( 4 )                                                    /*!< SC_T::STATUS: PEF Position             */
#define SC_STATUS_PEF_Msk         ( 0x1ul << SC_STATUS_PEF_Pos )                           /*!< SC_T::STATUS: PEF Mask                 */

#define SC_STATUS_FEF_Pos         ( 5 )                                                    /*!< SC_T::STATUS: FEF Position             */
#define SC_STATUS_FEF_Msk         ( 0x1ul << SC_STATUS_FEF_Pos )                           /*!< SC_T::STATUS: FEF Mask                 */

#define SC_STATUS_BEF_Pos         ( 6 )                                                    /*!< SC_T::STATUS: BEF Position             */
#define SC_STATUS_BEF_Msk         ( 0x1ul << SC_STATUS_BEF_Pos )                           /*!< SC_T::STATUS: BEF Mask                 */

#define SC_STATUS_TXOV_Pos        ( 8 )                                                    /*!< SC_T::STATUS: TXOV Position            */
#define SC_STATUS_TXOV_Msk        ( 0x1ul << SC_STATUS_TXOV_Pos )                          /*!< SC_T::STATUS: TXOV Mask                */

#define SC_STATUS_TXEMPTY_Pos     ( 9 )                                                    /*!< SC_T::STATUS: TXEMPTY Position         */
#define SC_STATUS_TXEMPTY_Msk     ( 0x1ul << SC_STATUS_TXEMPTY_Pos )                       /*!< SC_T::STATUS: TXEMPTY Mask             */

#define SC_STATUS_TXFULL_Pos      ( 10 )                                                   /*!< SC_T::STATUS: TXFULL Position          */
#define SC_STATUS_TXFULL_Msk      ( 0x1ul << SC_STATUS_TXFULL_Pos )                        /*!< SC_T::STATUS: TXFULL Mask              */

#define SC_STATUS_CREMOVE_Pos     ( 11 )                                                   /*!< SC_T::STATUS: CREMOVE Position         */
#define SC_STATUS_CREMOVE_Msk     ( 0x1ul << SC_STATUS_CREMOVE_Pos )                       /*!< SC_T::STATUS: CREMOVE Mask             */

#define SC_STATUS_CINSERT_Pos     ( 12 )                                                   /*!< SC_T::STATUS: CINSERT Position         */
#define SC_STATUS_CINSERT_Msk     ( 0x1ul << SC_STATUS_CINSERT_Pos )                       /*!< SC_T::STATUS: CINSERT Mask             */

#define SC_STATUS_CDPINSTS_Pos    ( 13 )                                                   /*!< SC_T::STATUS: CDPINSTS Position        */
#define SC_STATUS_CDPINSTS_Msk    ( 0x1ul << SC_STATUS_CDPINSTS_Pos )                      /*!< SC_T::STATUS: CDPINSTS Mask            */

#define SC_STATUS_RXPOINT_Pos     ( 16 )                                                   /*!< SC_T::STATUS: RXPOINT Position         */
#define SC_STATUS_RXPOINT_Msk     ( 0x7ul << SC_STATUS_RXPOINT_Pos )                       /*!< SC_T::STATUS: RXPOINT Mask             */

#define SC_STATUS_RXRERR_Pos      ( 21 )                                                   /*!< SC_T::STATUS: RXRERR Position          */
#define SC_STATUS_RXRERR_Msk      ( 0x1ul << SC_STATUS_RXRERR_Pos )                        /*!< SC_T::STATUS: RXRERR Mask              */

#define SC_STATUS_RXOVERR_Pos     ( 22 )                                                   /*!< SC_T::STATUS: RXOVERR Position         */
#define SC_STATUS_RXOVERR_Msk     ( 0x1ul << SC_STATUS_RXOVERR_Pos )                       /*!< SC_T::STATUS: RXOVERR Mask             */

#define SC_STATUS_RXACT_Pos       ( 23 )                                                   /*!< SC_T::STATUS: RXACT Position           */
#define SC_STATUS_RXACT_Msk       ( 0x1ul << SC_STATUS_RXACT_Pos )                         /*!< SC_T::STATUS: RXACT Mask               */

#define SC_STATUS_TXPOINT_Pos     ( 24 )                                                   /*!< SC_T::STATUS: TXPOINT Position         */
#define SC_STATUS_TXPOINT_Msk     ( 0x7ul << SC_STATUS_TXPOINT_Pos )                       /*!< SC_T::STATUS: TXPOINT Mask             */

#define SC_STATUS_TXRERR_Pos      ( 29 )                                                   /*!< SC_T::STATUS: TXRERR Position          */
#define SC_STATUS_TXRERR_Msk      ( 0x1ul << SC_STATUS_TXRERR_Pos )                        /*!< SC_T::STATUS: TXRERR Mask              */

#define SC_STATUS_TXOVERR_Pos     ( 30 )                                                   /*!< SC_T::STATUS: TXOVERR Position         */
#define SC_STATUS_TXOVERR_Msk     ( 0x1ul << SC_STATUS_TXOVERR_Pos )                       /*!< SC_T::STATUS: TXOVERR Mask             */

#define SC_STATUS_TXACT_Pos       ( 31 )                                                   /*!< SC_T::STATUS: TXACT Position           */
#define SC_STATUS_TXACT_Msk       ( 0x1ul << SC_STATUS_TXACT_Pos )                         /*!< SC_T::STATUS: TXACT Mask               */

#define SC_PINCTL_PWREN_Pos       ( 0 )                                                    /*!< SC_T::PINCTL: PWREN Position           */
#define SC_PINCTL_PWREN_Msk       ( 0x1ul << SC_PINCTL_PWREN_Pos )                         /*!< SC_T::PINCTL: PWREN Mask               */

#define SC_PINCTL_RSTEN_Pos       ( 1 )                                                    /*!< SC_T::PINCTL: RSTEN Position           */
#define SC_PINCTL_RSTEN_Msk       ( 0x1ul << SC_PINCTL_RSTEN_Pos )                         /*!< SC_T::PINCTL: RSTEN Mask               */

#define SC_PINCTL_CSTOPLV_Pos     ( 5 )                                                    /*!< SC_T::PINCTL: CSTOPLV Position         */
#define SC_PINCTL_CSTOPLV_Msk     ( 0x1ul << SC_PINCTL_CSTOPLV_Pos )                       /*!< SC_T::PINCTL: CSTOPLV Mask             */

#define SC_PINCTL_CLKKEEP_Pos     ( 6 )                                                    /*!< SC_T::PINCTL: CLKKEEP Position         */
#define SC_PINCTL_CLKKEEP_Msk     ( 0x1ul << SC_PINCTL_CLKKEEP_Pos )                       /*!< SC_T::PINCTL: CLKKEEP Mask             */

#define SC_PINCTL_SCDATA_Pos      ( 9 )                                                    /*!< SC_T::PINCTL: SCDATA Position          */
#define SC_PINCTL_SCDATA_Msk      ( 0x1ul << SC_PINCTL_SCDATA_Pos )                        /*!< SC_T::PINCTL: SCDATA Mask              */

#define SC_PINCTL_PWRINV_Pos      ( 11 )                                                   /*!< SC_T::PINCTL: PWRINV Position          */
#define SC_PINCTL_PWRINV_Msk      ( 0x1ul << SC_PINCTL_PWRINV_Pos )                        /*!< SC_T::PINCTL: PWRINV Mask              */

