FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sc_reg.h
#define SC_PINCTL_DATASTS_Pos     ( 16 )                                                   /*!< SC_T::PINCTL: DATASTS Position         */
#define SC_PINCTL_DATASTS_Msk     ( 0x1ul << SC_PINCTL_DATASTS_Pos )                       /*!< SC_T::PINCTL: DATASTS Mask             */

#define SC_PINCTL_PWRSTS_Pos      ( 17 )                                                   /*!< SC_T::PINCTL: PWRSTS Position          */
#define SC_PINCTL_PWRSTS_Msk      ( 0x1ul << SC_PINCTL_PWRSTS_Pos )                        /*!< SC_T::PINCTL: PWRSTS Mask              */

#define SC_PINCTL_RSTSTS_Pos      ( 18 )                                                   /*!< SC_T::PINCTL: RSTSTS Position          */
#define SC_PINCTL_RSTSTS_Msk      ( 0x1ul << SC_PINCTL_RSTSTS_Pos )                        /*!< SC_T::PINCTL: RSTSTS Mask              */

#define SC_PINCTL_SYNC_Pos        ( 30 )                                                   /*!< SC_T::PINCTL: SYNC Position            */
#define SC_PINCTL_SYNC_Msk        ( 0x1ul << SC_PINCTL_SYNC_Pos )                          /*!< SC_T::PINCTL: SYNC Mask                */

#define SC_TMRCTL0_CNT_Pos        ( 0 )                                                    /*!< SC_T::TMRCTL0: CNT Position            */
#define SC_TMRCTL0_CNT_Msk        ( 0xfffffful << SC_TMRCTL0_CNT_Pos )                     /*!< SC_T::TMRCTL0: CNT Mask                */

#define SC_TMRCTL0_OPMODE_Pos     ( 24 )                                                   /*!< SC_T::TMRCTL0: OPMODE Position         */
#define SC_TMRCTL0_OPMODE_Msk     ( 0xful << SC_TMRCTL0_OPMODE_Pos )                       /*!< SC_T::TMRCTL0: OPMODE Mask             */

#define SC_TMRCTL0_SYNC_Pos       ( 31 )                                                   /*!< SC_T::TMRCTL0: SYNC Position           */
#define SC_TMRCTL0_SYNC_Msk       ( 0x1ul << SC_TMRCTL0_SYNC_Pos )                         /*!< SC_T::TMRCTL0: SYNC Mask               */

#define SC_TMRCTL1_CNT_Pos        ( 0 )                                                    /*!< SC_T::TMRCTL1: CNT Position            */
#define SC_TMRCTL1_CNT_Msk        ( 0xfful << SC_TMRCTL1_CNT_Pos )                         /*!< SC_T::TMRCTL1: CNT Mask                */

#define SC_TMRCTL1_OPMODE_Pos     ( 24 )                                                   /*!< SC_T::TMRCTL1: OPMODE Position         */
#define SC_TMRCTL1_OPMODE_Msk     ( 0xful << SC_TMRCTL1_OPMODE_Pos )                       /*!< SC_T::TMRCTL1: OPMODE Mask             */

#define SC_TMRCTL1_SYNC_Pos       ( 31 )                                                   /*!< SC_T::TMRCTL1: SYNC Position           */
#define SC_TMRCTL1_SYNC_Msk       ( 0x1ul << SC_TMRCTL1_SYNC_Pos )                         /*!< SC_T::TMRCTL1: SYNC Mask               */

#define SC_TMRCTL2_CNT_Pos        ( 0 )                                                    /*!< SC_T::TMRCTL2: CNT Position            */
#define SC_TMRCTL2_CNT_Msk        ( 0xfful << SC_TMRCTL2_CNT_Pos )                         /*!< SC_T::TMRCTL2: CNT Mask                */

#define SC_TMRCTL2_OPMODE_Pos     ( 24 )                                                   /*!< SC_T::TMRCTL2: OPMODE Position         */
#define SC_TMRCTL2_OPMODE_Msk     ( 0xful << SC_TMRCTL2_OPMODE_Pos )                       /*!< SC_T::TMRCTL2: OPMODE Mask             */

#define SC_TMRCTL2_SYNC_Pos       ( 31 )                                                   /*!< SC_T::TMRCTL2: SYNC Position           */
#define SC_TMRCTL2_SYNC_Msk       ( 0x1ul << SC_TMRCTL2_SYNC_Pos )                         /*!< SC_T::TMRCTL2: SYNC Mask               */

#define SC_UARTCTL_UARTEN_Pos     ( 0 )                                                    /*!< SC_T::UARTCTL: UARTEN Position         */
#define SC_UARTCTL_UARTEN_Msk     ( 0x1ul << SC_UARTCTL_UARTEN_Pos )                       /*!< SC_T::UARTCTL: UARTEN Mask             */

#define SC_UARTCTL_WLS_Pos        ( 4 )                                                    /*!< SC_T::UARTCTL: WLS Position            */
#define SC_UARTCTL_WLS_Msk        ( 0x3ul << SC_UARTCTL_WLS_Pos )                          /*!< SC_T::UARTCTL: WLS Mask                */

#define SC_UARTCTL_PBOFF_Pos      ( 6 )                                                    /*!< SC_T::UARTCTL: PBOFF Position          */
#define SC_UARTCTL_PBOFF_Msk      ( 0x1ul << SC_UARTCTL_PBOFF_Pos )                        /*!< SC_T::UARTCTL: PBOFF Mask              */

#define SC_UARTCTL_OPE_Pos        ( 7 )                                                    /*!< SC_T::UARTCTL: OPE Position            */
#define SC_UARTCTL_OPE_Msk        ( 0x1ul << SC_UARTCTL_OPE_Pos )                          /*!< SC_T::UARTCTL: OPE Mask                */

#define SC_ACTCTL_T1EXT_Pos       ( 0 )                                                    /*!< SC_T::ACTCTL: T1EXT Position           */
#define SC_ACTCTL_T1EXT_Msk       ( 0x1ful << SC_ACTCTL_T1EXT_Pos )                        /*!< SC_T::ACTCTL: T1EXT Mask               */

/**@}*/ /* SC_CONST */
/**@}*/ /* end of SC register group */
/**@}*/ /* end of REGISTER group */

#endif /* __SC_REG_H__ */
